<?php

namespace App\Controller\Misc;

use App\Controller\Data\UsersController;
use Twig\Extension\AbstractExtension;
use Twig\TwigFunction;

class TwigExtension extends AbstractExtension
{
    public function getFunctions()
    {
        return [
            new TwigFunction('answers', [$this, 'preparedAnswers']),
            new TwigFunction('allClients', [$this, 'allClients']),
            new TwigFunction('userID', [$this, 'getUserID']),
            new TwigFunction('payments', [$this, 'paymentMethods']),
            new TwigFunction('dump', [$this, 'getDump']),
            new TwigFunction('transactoinsImgs', [$this, 'billingTransactionsSvg']),
            new TwigFunction('getGet', [$this, 'getGet'])
        ];
    }

    public function allClients() {
        return UsersController::CreateTable();
    }

    public static function getUserID()
    {
        static $getID;

        if($_GET) {
            $getID = current($_GET);
        }

        return $getID ?: 111;
    }

    public static function getGet() {
        static $get;

        if($_GET) {
            $get = current($_GET);
        }

        return $get;
    }

    public static function getDump() {
        return dd($_GET);
    }

    public static function paymentMethods() {
        $list = [
            'balance',
            'payssionwebmoney',
            'interkassa', 'payssionqiwi',
            'capitalist',
            'payssionunionpay',
            'payssionboletobr',
            'payssiondotpaypl',
            'payssionalipaycn',
            'payssionidealnl',
            'testgw',
            'payssion_test',
            'advcash',
            'stripe',
            'paxum',
            'payeer',
            'coingate',
            'tinkoff',
            'lava',
            'coinpayments',
            'webmoney',
            'cryptomus'
        ];

        return $list;
    }

    public static function preparedAnswers() {
        $list = [
            ['Нарушения' => ['BREIN', 'SMTP KYC', 'Благодарим за решение проблемы', 'Жалоба на сервер', 'Разблокировка в случае серьёзных жалоб / KYC', 'Требуется верификация для разблокировки ВПС']],
            ['IP адреса' => ['192.168.1.1', '192.168.1.2', '192.168.1.3', '192.168.1.4']],
            ['SSL сертификаты' => ['Item 1', 'Item 2', 'Item 3', 'Item 4']],
        ];

        $list2 = [
            ['level1' => 'Нарушения', 'level2' => ['BREIN', 'SMTP KYC', 'Благодарим за решение проблемы', 'Жалоба на сервер', 'Разблокировка в случае серьёзных жалоб / KYC', 'Требуется верификация для разблокировки ВПС']],
            ['level1' => 'IP адреса', 'level2' => ['192.168.1.1', '192.168.1.2', '192.168.1.3', '192.168.1.4']],
            ['level1' => 'SSL сертификаты', 'level2' => ['Item 1', 'Item 2', 'Item 3', 'Item 4']],
            ['level1' => 'Биллинг', 'level2' => ['Item 1', 'Item 2', 'Item 3', 'Item 4']],
            ['level1' => 'Бухгалтерия', 'level2' => ['Item 1', 'Item 2', 'Item 3', 'Item 4']],
            ['level1' => 'Верификация', 'level2' => ['Item 1', 'Item 2', 'Item 3', 'Item 4']],
            ['level1' => 'Вопросы по заказу', 'level2' => ['Item 1', 'Item 2', 'Item 3', 'Item 4']],
            ['level1' => 'Партнёрская программа', 'level2' => ['Item 1', 'Item 2', 'Item 3', 'Item 4']],
            ['level1' => 'Уведомления', 'level2' => ['Item 1', 'Item 2', 'Item 3', 'Item 4']],
        ];

        return $list;
    }

    public static function billingTransactionsSvg() {
        $list = [
            ['type' => 1, 'title' => 'Оплаченный инвойс', 'img' => '<svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg"><title>Оплаченный инвойс</title><path fill-rule="evenodd" clip-rule="evenodd" d="M3 3.5C3 2.67157 3.67157 2 4.5 2H11.3787C11.7765 2 12.158 2.15804 12.4393 2.43934L16.5607 6.56066C16.842 6.84197 17 7.2235 17 7.62132V16.5C17 17.3284 16.3284 18 15.5 18H4.5C3.67157 18 3 17.3284 3 16.5V3.5ZM13.8566 9.19113C14.1002 8.85614 14.0261 8.38708 13.6911 8.14345C13.3561 7.89982 12.8871 7.97388 12.6434 8.30887L9.15969 13.099L7.28033 11.2197C6.98744 10.9268 6.51256 10.9268 6.21967 11.2197C5.92678 11.5126 5.92678 11.9874 6.21967 12.2803L8.71967 14.7803C8.87477 14.9354 9.08999 15.0149 9.30867 14.9977C9.52734 14.9805 9.72754 14.8685 9.85655 14.6911L13.8566 9.19113Z" fill="#10B981"/></svg>'],
            ['type' => 2, 'title' => 'Неоплаченный инвойс', 'img' => '<svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg"><title>Неоплаченный инвойс</title><path fill-rule="evenodd" clip-rule="evenodd" d="M4.5 2C3.67157 2 3 2.67157 3 3.5V16.5C3 17.3284 3.67157 18 4.5 18H15.5C16.3284 18 17 17.3284 17 16.5V7.62132C17 7.2235 16.842 6.84197 16.5607 6.56066L12.4393 2.43934C12.158 2.15804 11.7765 2 11.3787 2H4.5ZM9.875 14.5C9.59886 14.5 9.375 14.2761 9.375 14V13.875C8.51054 13.875 7.78272 13.29 7.56583 12.4943C7.49321 12.2278 7.72386 12 8 12H8.25C8.49098 12 8.68566 12.1949 8.86296 12.3724L8.863 12.3725C8.88886 12.3983 8.91434 12.4239 8.93954 12.4483C9.0521 12.5577 9.20569 12.625 9.375 12.625V11.375C8.33947 11.375 7.5 10.5355 7.5 9.5C7.5 8.46447 8.33947 7.625 9.375 7.625V7.5C9.375 7.22386 9.59886 7 9.875 7H10.125C10.4011 7 10.625 7.22386 10.625 7.5V7.625C11.4895 7.625 12.2173 8.21001 12.4342 9.00573C12.5068 9.27215 12.2761 9.5 12 9.5H11.75C11.509 9.5 11.3143 9.3051 11.137 9.12759L11.1369 9.12745C11.1111 9.1016 11.0856 9.07612 11.0605 9.05167C10.9479 8.94233 10.7943 8.875 10.625 8.875V10.125C11.6605 10.125 12.5 10.9645 12.5 12C12.5 13.0355 11.6605 13.875 10.625 13.875V14C10.625 14.2761 10.4011 14.5 10.125 14.5H9.875ZM8.75 9.5C8.75 9.15482 9.02982 8.875 9.375 8.875V10.125C9.02982 10.125 8.75 9.84518 8.75 9.5ZM11.25 12C11.25 12.3452 10.9702 12.625 10.625 12.625V11.375C10.9702 11.375 11.25 11.6548 11.25 12Z" fill="#EF4444"/></svg>'],
            ['type' => 3, 'title' => 'Отменённый инвойс', 'img' => '<svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg"><title>Отменённый инвойс</title><path fill-rule="evenodd" clip-rule="evenodd" d="M4.5 2C3.67157 2 3 2.67157 3 3.5V16.5C3 17.3284 3.67157 18 4.5 18H15.5C16.3284 18 17 17.3284 17 16.5V7.62132C17 7.2235 16.842 6.84197 16.5607 6.56066L12.4393 2.43934C12.158 2.15804 11.7765 2 11.3787 2H4.5ZM8.28033 8.21967C7.98744 7.92678 7.51256 7.92678 7.21967 8.21967C6.92678 8.51256 6.92678 8.98744 7.21967 9.28033L8.93934 11L7.21967 12.7197C6.92678 13.0126 6.92678 13.4874 7.21967 13.7803C7.51256 14.0732 7.98744 14.0732 8.28033 13.7803L10 12.0607L11.7197 13.7803C12.0126 14.0732 12.4874 14.0732 12.7803 13.7803C13.0732 13.4874 13.0732 13.0126 12.7803 12.7197L11.0607 11L12.7803 9.28033C13.0732 8.98744 13.0732 8.51256 12.7803 8.21967C12.4874 7.92678 12.0126 7.92678 11.7197 8.21967L10 9.93934L8.28033 8.21967Z" fill="#6B7280"/></svg>'],
            ['type' => 4, 'title' => 'Несуществующий платёж', 'img' => '<svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg"><title>Несуществующий платёж</title><path fill-rule="evenodd" clip-rule="evenodd" d="M3.5 3C2.67157 3 2 3.67157 2 4.5V15.5C2 16.3284 2.67157 17 3.5 17H16.5C17.3284 17 18 16.3284 18 15.5V4.5C18 3.67157 17.3284 3 16.5 3H3.5ZM9.875 13.75C9.59886 13.75 9.375 13.5261 9.375 13.25V13.125C8.51054 13.125 7.78272 12.54 7.56583 11.7443C7.49321 11.4778 7.72386 11.25 8 11.25H8.25C8.49098 11.25 8.68566 11.4449 8.86296 11.6224L8.863 11.6225C8.88886 11.6483 8.91434 11.6739 8.93954 11.6983C9.0521 11.8077 9.20569 11.875 9.375 11.875V10.625C8.33947 10.625 7.5 9.78553 7.5 8.75C7.5 7.71447 8.33947 6.875 9.375 6.875V6.75C9.375 6.47386 9.59886 6.25 9.875 6.25H10.125C10.4011 6.25 10.625 6.47386 10.625 6.75V6.875C11.4895 6.875 12.2173 7.46001 12.4342 8.25573C12.5068 8.52215 12.2761 8.75 12 8.75H11.75C11.509 8.75 11.3143 8.5551 11.137 8.37759L11.1369 8.37745C11.1111 8.3516 11.0856 8.32612 11.0605 8.30167C10.9479 8.19233 10.7943 8.125 10.625 8.125V9.375C11.6605 9.375 12.5 10.2145 12.5 11.25C12.5 12.2855 11.6605 13.125 10.625 13.125V13.25C10.625 13.5261 10.4011 13.75 10.125 13.75H9.875ZM8.75 8.75C8.75 8.40482 9.02982 8.125 9.375 8.125V9.375C9.02982 9.375 8.75 9.09518 8.75 8.75ZM11.25 11.25C11.25 11.5952 10.9702 11.875 10.625 11.875V10.625C10.9702 10.625 11.25 10.9048 11.25 11.25Z" fill="#D1D5DB"/></svg>'],
            ['type' => 5, 'title' => 'Несуществующий инвойс', 'img' => '<svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg"><title>Несуществующий инвойс</title><path fill-rule="evenodd" clip-rule="evenodd" d="M3 3.5C3 2.67157 3.67157 2 4.5 2H11.3787C11.7765 2 12.158 2.15804 12.4393 2.43934L16.5607 6.56066C16.842 6.84197 17 7.2235 17 7.62132V16.5C17 17.3284 16.3284 18 15.5 18H4.5C3.67157 18 3 17.3284 3 16.5V3.5Z" fill="#D1D5DB"/></svg>'],
            ['type' => 6, 'title' => 'Задан клиент', 'img' => '<svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg"><title>Задан клиент</title><path d="M10 8C11.6569 8 13 6.65685 13 5C13 3.34315 11.6569 2 10 2C8.34315 2 7 3.34315 7 5C7 6.65685 8.34315 8 10 8Z" fill="#6B7280"/><path d="M3.46517 14.4935C3.27029 15.0016 3.44435 15.571 3.8742 15.9046C5.56656 17.218 7.69202 18 10.0001 18C12.3106 18 14.438 17.2164 16.1312 15.9006C16.5608 15.5667 16.7345 14.9971 16.5393 14.4892C15.5301 11.8635 12.9842 10 10.0031 10C7.02032 10 4.47329 11.8656 3.46517 14.4935Z" fill="#6B7280"/></svg>'],
            ['type' => 7, 'title' => 'Платёж без инвойса', 'img' => '<svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg"><title>Платёж без инвойса</title><path fill-rule="evenodd" clip-rule="evenodd" d="M3.5 3C2.67157 3 2 3.67157 2 4.5V15.5C2 16.3284 2.67157 17 3.5 17H16.5C17.3284 17 18 16.3284 18 15.5V4.5C18 3.67157 17.3284 3 16.5 3H3.5ZM7.64286 6C7.28782 6 7 6.33579 7 6.75V13.25C7 13.6642 7.28782 14 7.64286 14H12.3571C12.7122 14 13 13.6642 13 13.25V8.81066C13 8.61175 12.9323 8.42098 12.8117 8.28033L11.0454 6.21967C10.9249 6.07902 10.7614 6 10.5909 6H7.64286Z" fill="#EF4444"/></svg>'],
            ['type' => 8, 'title' => 'Нет информации', 'img' => '<svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg"><title>Нет информации</title><path fill-rule="evenodd" clip-rule="evenodd" d="M4.5 2C3.67157 2 3 2.67157 3 3.5V16.5C3 17.3284 3.67157 18 4.5 18H15.5C16.3284 18 17 17.3284 17 16.5V7.62132C17 7.2235 16.842 6.84197 16.5607 6.56066L12.4393 2.43934C12.158 2.15804 11.7765 2 11.3787 2H4.5ZM11 6C11 6.55228 10.5523 7 10 7C9.44771 7 9 6.55228 9 6C9 5.44772 9.44771 5 10 5C10.5523 5 11 5.44772 11 6ZM9 9C8.58579 9 8.25 9.33579 8.25 9.75C8.25 10.1642 8.58579 10.5 9 10.5H9.25338C9.41332 10.5 9.53213 10.6481 9.49743 10.8042L9.03829 12.8704C8.79542 13.9633 9.62706 15 10.7466 15H11C11.4142 15 11.75 14.6642 11.75 14.25C11.75 13.8358 11.4142 13.5 11 13.5H10.7466C10.5867 13.5 10.4679 13.3519 10.5026 13.1958L10.9617 11.1296C11.2046 10.0367 10.3729 9 9.25338 9H9Z" fill="#D1D5DB"/></svg>'],
        ];

        return $list;
    }
}